; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	image3 - mode
	infrared1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	star1 - direction
	star0 - direction
	groundstation2 - direction
	groundstation3 - direction
	star4 - direction
	planet5 - direction
	planet6 - direction
	phenomenon7 - direction
	star8 - direction
	phenomenon9 - direction
	star10 - direction
	planet11 - direction
	star12 - direction
	phenomenon13 - direction
	phenomenon14 - direction
	phenomenon15 - direction
	phenomenon16 - direction
	phenomenon17 - direction
	phenomenon18 - direction
	star19 - direction
	star20 - direction
	planet21 - direction
	planet22 - direction
	phenomenon23 - direction
	planet24 - direction
	star25 - direction
	planet26 - direction
	star27 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 star1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 star1)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon16)
	(supports instrument3 image3)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 groundstation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet24)
	(supports instrument4 image3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 star4)
	(supports instrument5 image3)
	(calibration_target instrument5 star0)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon15)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 star0)
	(supports instrument8 image3)
	(calibration_target instrument8 groundstation3)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared1)
	(supports instrument9 image3)
	(calibration_target instrument9 groundstation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon7)
	(supports instrument10 thermograph2)
	(supports instrument10 infrared1)
	(supports instrument10 image3)
	(calibration_target instrument10 groundstation3)
	(supports instrument11 spectrograph4)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 star4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star1)
)
(:goal (and
	(pointing satellite1 phenomenon7)
	(pointing satellite3 phenomenon16)
	(have_image planet5 image3)
	(have_image planet6 thermograph2)
	(have_image phenomenon7 spectrograph0)
	(have_image phenomenon9 spectrograph4)
	(have_image star10 spectrograph0)
	(have_image planet11 thermograph2)
	(have_image star12 infrared1)
	(have_image phenomenon13 infrared1)
	(have_image phenomenon14 thermograph2)
	(have_image phenomenon16 spectrograph0)
	(have_image phenomenon18 infrared1)
	(have_image star19 thermograph2)
	(have_image star20 spectrograph0)
	(have_image planet21 spectrograph0)
	(have_image planet22 spectrograph0)
	(have_image phenomenon23 spectrograph0)
	(have_image planet24 spectrograph0)
	(have_image star25 thermograph2)
	(have_image planet26 spectrograph4)
	(have_image star27 thermograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 22
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 22
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 22
4. (turn_to satellite4 groundstation3 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 22
5. (calibrate satellite4 instrument10 groundstation3)
   added: (calibrated instrument10)
   goals met: 0 of 22
6. (turn_to satellite4 phenomenon13 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 22
7. (take_image satellite4 phenomenon13 instrument10 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 1 of 22
8. (turn_to satellite4 phenomenon14 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 22
9. (take_image satellite4 phenomenon14 instrument10 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 2 of 22
10. (turn_to satellite4 phenomenon18 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon18)
   goals met: 2 of 22
11. (take_image satellite4 phenomenon18 instrument10 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 3 of 22
12. (turn_to satellite4 planet11 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 planet11)
   goals met: 3 of 22
13. (take_image satellite4 planet11 instrument10 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 22
14. (turn_to satellite4 planet5 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet5)
   goals met: 4 of 22
15. (take_image satellite4 planet5 instrument10 image3)
   added: (have_image planet5 image3)
   goals met: 5 of 22
16. (turn_to satellite4 planet6 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet6)
   goals met: 5 of 22
17. (take_image satellite4 planet6 instrument10 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 6 of 22
18. (turn_to satellite4 star12 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star12)
   goals met: 6 of 22
19. (take_image satellite4 star12 instrument10 infrared1)
   added: (have_image star12 infrared1)
   goals met: 7 of 22
20. (turn_to satellite4 star19 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star19)
   goals met: 7 of 22
21. (take_image satellite4 star19 instrument10 thermograph2)
   added: (have_image star19 thermograph2)
   goals met: 8 of 22
22. (turn_to satellite4 star25 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star25)
   goals met: 8 of 22
23. (take_image satellite4 star25 instrument10 thermograph2)
   added: (have_image star25 thermograph2)
   goals met: 9 of 22
24. (turn_to satellite4 star27 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star27)
   goals met: 9 of 22
25. (take_image satellite4 star27 instrument10 thermograph2)
   added: (have_image star27 thermograph2)
   goals met: 10 of 22
26. (turn_to satellite3 phenomenon16 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon16)
   goals met: 11 of 22
27. (turn_to satellite1 groundstation2 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 groundstation2)
   goals met: 11 of 22
28. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 11 of 22
29. (turn_to satellite1 phenomenon16 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon16)
   goals met: 11 of 22
30. (take_image satellite1 phenomenon16 instrument3 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 12 of 22
31. (turn_to satellite1 phenomenon23 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon23)
   goals met: 12 of 22
32. (take_image satellite1 phenomenon23 instrument3 spectrograph0)
   added: (have_image phenomenon23 spectrograph0)
   goals met: 13 of 22
33. (turn_to satellite1 phenomenon7 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon7)
   goals met: 14 of 22
34. (take_image satellite1 phenomenon7 instrument3 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 15 of 22
35. (turn_to satellite0 phenomenon9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon9)
   goals met: 15 of 22
36. (turn_to satellite1 planet21 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet21)
   goals met: 14 of 22
37. (take_image satellite1 planet21 instrument3 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 15 of 22
38. (turn_to satellite1 phenomenon7 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 phenomenon7)
   goals met: 16 of 22
39. (turn_to satellite1 planet22 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet22)
   goals met: 15 of 22
40. (take_image satellite1 planet22 instrument3 spectrograph0)
   added: (have_image planet22 spectrograph0)
   goals met: 16 of 22
41. (turn_to satellite1 phenomenon7 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 phenomenon7)
   goals met: 17 of 22
42. (turn_to satellite1 star10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star10)
   goals met: 16 of 22
43. (take_image satellite1 star10 instrument3 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 17 of 22
44. (turn_to satellite1 phenomenon7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon7)
   goals met: 18 of 22
45. (turn_to satellite1 star20 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star20)
   goals met: 17 of 22
46. (take_image satellite1 star20 instrument3 spectrograph0)
   added: (have_image star20 spectrograph0)
   goals met: 18 of 22
47. (turn_to satellite1 phenomenon7 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 phenomenon7)
   goals met: 19 of 22
48. (turn_to satellite1 planet24 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet24)
   goals met: 18 of 22
49. (take_image satellite1 planet24 instrument3 spectrograph0)
   added: (have_image planet24 spectrograph0)
   goals met: 19 of 22
50. (turn_to satellite1 phenomenon7 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 phenomenon7)
   goals met: 20 of 22
51. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 20 of 22
52. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 20 of 22
53. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 20 of 22
54. (take_image satellite0 phenomenon9 instrument1 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 21 of 22
55. (turn_to satellite0 planet26 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet26)
   goals met: 21 of 22
56. (take_image satellite0 planet26 instrument1 spectrograph4)
   added: (have_image planet26 spectrograph4)
   goals met: 22 of 22
